"""
1.신문배달
각 층별로
구독 목록
[
    [101,102,104,105,109]
    [203,205,206,208,209]
    [301,302,303,304,305,306,307]
    [402,404,405,406,408,410]
]
구독 취소 목록
[
    [101,104]
    [205,206,208]
    [301,305]
    [405,406,408]
]
새로운 구독 목록
"""

newsnow = [[101,102,104,105,109],[203,205,206,208,209],[301,302,303,304,305,306,307],[402,404,405,406,408,410]]

newscancel=[[101,104],[205,206,208],[301,305],[405,406,408]]


# 컴프리헨션 사용
a=[1,2,3,4,5]
b=[1,2,3]
c=[i for i in a if i not in b]
print(c)


newswill=[]
for i in range(0,len(newsnow)):
    newItem = [item for item in newsnow[i] if item not in newscancel[i]]
    newswill.append(newItem)

print(newswill)